Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF6493.PIC
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="LCDCON" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="LCDCON" edc:nzwidth="0x8" edc:por="000-0000" edc:_addr="0xF59">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LMUX" edc:desc="" edc:mask="0x3" edc:name="LMUX" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WERR" edc:desc="" edc:mask="0x1" edc:name="WERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDEN" edc:desc="" edc:mask="0x1" edc:name="LCDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LMUX0" edc:desc="" edc:mask="0x1" edc:name="LMUX0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LMUX1" edc:desc="" edc:mask="0x1" edc:name="LMUX1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LCDCS0" edc:desc="" edc:mask="0x1" edc:name="LCDCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDCS1" edc:desc="" edc:mask="0x1" edc:name="LCDCS1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LCDWERR" edc:desc="" edc:mask="0x1" edc:name="LCDWERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDSLPEN" edc:desc="" edc:mask="0x1" edc:name="LCDSLPEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDSE0" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF5A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE0" edc:desc="" edc:mask="0xff" edc:name="LCDSE0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE0" edc:desc="" edc:mask="0x1" edc:name="SE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE1" edc:desc="" edc:mask="0x1" edc:name="SE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE2" edc:desc="" edc:mask="0x1" edc:name="SE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE3" edc:desc="" edc:mask="0x1" edc:name="SE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE4" edc:desc="" edc:mask="0x1" edc:name="SE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE5" edc:desc="" edc:mask="0x1" edc:name="SE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE6" edc:desc="" edc:mask="0x1" edc:name="SE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE7" edc:desc="" edc:mask="0x1" edc:name="SE7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN0" edc:desc="" edc:mask="0x1" edc:name="SEGEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN1" edc:desc="" edc:mask="0x1" edc:name="SEGEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN2" edc:desc="" edc:mask="0x1" edc:name="SEGEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN3" edc:desc="" edc:mask="0x1" edc:name="SEGEN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN4" edc:desc="" edc:mask="0x1" edc:name="SEGEN4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN5" edc:desc="" edc:mask="0x1" edc:name="SEGEN5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN6" edc:desc="" edc:mask="0x1" edc:name="SEGEN6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN7" edc:desc="" edc:mask="0x1" edc:name="SEGEN7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDSE1" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF5B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE1" edc:desc="" edc:mask="0xff" edc:name="LCDSE1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE8" edc:desc="" edc:mask="0x1" edc:name="SE8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE9" edc:desc="" edc:mask="0x1" edc:name="SE9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE10" edc:desc="" edc:mask="0x1" edc:name="SE10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE11" edc:desc="" edc:mask="0x1" edc:name="SE11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE12" edc:desc="" edc:mask="0x1" edc:name="SE12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE13" edc:desc="" edc:mask="0x1" edc:name="SE13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE14" edc:desc="" edc:mask="0x1" edc:name="SE14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE15" edc:desc="" edc:mask="0x1" edc:name="SE15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN8" edc:desc="" edc:mask="0x1" edc:name="SEGEN8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN9" edc:desc="" edc:mask="0x1" edc:name="SEGEN9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN10" edc:desc="" edc:mask="0x1" edc:name="SEGEN10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN11" edc:desc="" edc:mask="0x1" edc:name="SEGEN11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN12" edc:desc="" edc:mask="0x1" edc:name="SEGEN12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN13" edc:desc="" edc:mask="0x1" edc:name="SEGEN13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN14" edc:desc="" edc:mask="0x1" edc:name="SEGEN14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN15" edc:desc="" edc:mask="0x1" edc:name="SEGEN15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
